aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ota/aws_ota_pal.c
/*
 * Amazon FreeRTOS OTA PAL V1.0.0
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file aws_ota_pal.c
 * @brief Platform Abstraction layer for AWS OTA
 *
 */

/* C Runtime includes. */
#include <string.h>

/* Amazon FreeRTOS include. */
#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "aws_iot_ota_pal.h"
#include "bootutil/bootutil.h"
#include "sysflash/sysflash.h"
#include "flash_map_backend/flash_map_backend.h"
#include "cy_pdl.h"
#include "aws_application_version.h"
#include "aws_ota_codesigner_certificate.h"
#include "mbedtls/base64.h"
#include "mbedtls/sha256.h"
#include "iot_crypto.h"


/**
 * @brief File Signature Key
 *
 * The OTA signature algorithm we support on this platform.
 */
const char cOTA_JSON_FileSignatureKey[ OTA_FILE_SIG_KEY_STR_MAX_LENGTH ] = "sig-sha256-ecdsa";

/***********************************************************************
 *
 * defines
 *
 **********************************************************************/
static const char pcOTA_PAL_CERT_BEGIN[] = "-----BEGIN CERTIFICATE-----";
static const char pcOTA_PAL_CERT_END[] = "-----END CERTIFICATE-----";

/***********************************************************************
 *
 * Macros
 *
 **********************************************************************/
#if 1   /* Debugging macros */
/**
 * @brief Macro to print system context information
 */
#define PRINT_SYSTEM_CONTEXT_PTR()
/**
 * @brief Macro to print Boot swap type
 */
#define PRINT_BOOT_SWAP_TYPE( title, boot_type )
/**
 * @brief Macro to print eState value
 */
#define PRINT_eSTATE( title, eSTATE )
/**
 * @brief Macro to print PAL state
 */
#define PRINT_PAL_STATE( title, palState )
#else
#define PRINT_SYSTEM_CONTEXT_PTR()  configPRINTF(("   sys_ctx: %p\r\n", sys_ctx));

#define PRINT_BOOT_SWAP_TYPE( title, boot_type ) \
    configPRINTF( ( "%s:: boot_swap_type:%d (%s)\r\n", ((title == NULL)?"":title), \
             boot_type, ((boot_type == 0) ? "Unknown" :             \
              (boot_type == BOOT_SWAP_TYPE_NONE) ? "None" :         \
              (boot_type == BOOT_SWAP_TYPE_TEST) ? "Test" :         \
              (boot_type == BOOT_SWAP_TYPE_PERM) ? "Permanent" :    \
              (boot_type == BOOT_SWAP_TYPE_REVERT) ? "Revert" :     \
              (boot_type == BOOT_SWAP_TYPE_FAIL) ? "FAIL" :         \
              (boot_type == BOOT_SWAP_TYPE_PANIC) ? "PANIC !!" : "Bad State")   ) );

#define PRINT_eSTATE( title, state ) \
    configPRINTF( ( "%s::   Sys Image State: 0x%lx (%s) \r\n", ((title == NULL)?"":title), \
             state, ((state == eOTA_ImageState_Unknown) ? "Unknown" :  \
             (state == eOTA_ImageState_Testing) ? "Testing" :          \
             (state == eOTA_ImageState_Accepted) ? "Accepted" :        \
             (state == eOTA_ImageState_Rejected) ? "Rejected" :        \
             (state == eOTA_ImageState_Aborted) ? "Aborted" : "ERROR") ) );

#define PRINT_PAL_STATE( title, palState ) \
    configPRINTF( ( "%s::   PAL Image State: 0x%lx (%s) \r\n", ((title == NULL)?"":title), \
            palState, ((palState == eOTA_PAL_ImageState_Unknown) ? "Unknown" :  \
             (palState == eOTA_PAL_ImageState_PendingCommit) ? "Pending" :          \
             (palState == eOTA_PAL_ImageState_Valid) ? "Valid" :        \
             (palState == eOTA_PAL_ImageState_Invalid) ? "Invalid" : "ERROR") ) );

#endif  /* Debugging Macros */

/***********************************************************************
 *
 * Structures
 *
 **********************************************************************/

/***********************************************************************
 *
 * Variables
 *
 **********************************************************************/
/**
 * @brief Copy of system context
 *
 * Keep track of system context
 */
const OTA_FileContext_t *sys_ctx;

/**
 * @brief Current OTA Image State
 *
 * Keep track of the state OTA Agent wants us to be in.
 */
static OTA_ImageState_t current_OTA_ImageState = eOTA_ImageState_Unknown;


/**
 * @brief Current OTA Image State
 *
 * buffer for reading image to verify signature
 */
static uint8_t buffer[256];

/***********************************************************************
 *
 * Functions
 *
 **********************************************************************/

/**
 * @brief Read the specified signer certificate from the filesystem into a local buffer.
 *
 * The allocated memory returned becomes the property of the caller who is responsible for freeing it.
 *
 * This function is called from prvPAL_CheckFileSignature(). It should be implemented if signature
 * verification is not offloaded to non-volatile memory io function.
 *
 * @param[in] pucCertName The file path of the certificate file.
 * @param[out] ulSignerCertSize The size of the certificate file read.
 *
 * @return A pointer to the signer certificate in the file system. NULL if the certificate cannot be read.
 * This returned pointer is the responsibility of the caller; if the memory is allocated the caller must free it.
 */
static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    uint8_t *pucCertEnd;
    uint8_t *pucDecodedCertificate ;
    size_t ulDecodedCertificateSize;

    *ulSignerCertSize = sizeof(signingcredentialSIGNING_CERTIFICATE_PEM);
    /* Skip the "BEGIN CERTIFICATE" */
    uint8_t* pucCertBegin = (uint8_t *)strstr (signingcredentialSIGNING_CERTIFICATE_PEM, pcOTA_PAL_CERT_BEGIN) ;
    if (pucCertBegin == NULL)
    {
        configPRINTF( ( "%s() No Begin found for Certificate\r\n", __func__) );
        return NULL;
    }
    pucCertBegin += sizeof(pcOTA_PAL_CERT_BEGIN);

    /* Find the "END CERTIFICATE" */
    pucCertEnd =  (uint8_t *)strstr((char *)pucCertBegin, pcOTA_PAL_CERT_END);
    if (pucCertEnd == NULL)
    {
        configPRINTF( ( "%s() No END found for Certificate\r\n", __func__) );
        return NULL;
    }

    mbedtls_base64_decode(NULL, 0, &ulDecodedCertificateSize, pucCertBegin, pucCertEnd - pucCertBegin);
    pucDecodedCertificate = (uint8_t *) pvPortMalloc(ulDecodedCertificateSize);
    if (pucDecodedCertificate == NULL)
    {
        configPRINTF( ( "%s() Failed to decode the Certificate\r\n", __func__) );
        return NULL;
    }
    mbedtls_base64_decode(pucDecodedCertificate, ulDecodedCertificateSize, &ulDecodedCertificateSize, pucCertBegin, pucCertEnd - pucCertBegin);

    return pucDecodedCertificate;
}

/**
 * @brief erase the second slot to prepare for writing OTA'ed application
 *
 * @param   N/A
 *
 * @return   0 on success
 *          -1 on error
 */
static int eraseSlotTwo( void )
{
    const struct flash_area *fap ;

    if (flash_area_open(FLASH_AREA_IMAGE_SECONDARY(0), &fap) != 0)
    {
        configPRINTF( ( "%s() flash_area_open(FLASH_AREA_IMAGE_SECONDARY(0)) failed\r\n", __func__) );
        return -1 ;
    }
    if (flash_area_erase(fap, 0, fap->fa_size) != 0)
    {
        configPRINTF( ( "%s() flash_area_erase(fap, 0) failed\r\n", __func__) );
        return -1 ;
    }

    flash_area_close(fap) ;

