aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ota/aws_ota_pal.c
    return 0 ;
}

/**
 * @brief Verify the signature of the specified file.
 *
 * This function should be implemented if signature verification is not offloaded
 * to non-volatile memory io functions.
 *
 * This function is called from prvPAL_Close().
 *
 * @param[in] C OTA file context information.
 *
 * @return Below are the valid return values for this function.
 * kOTA_Err_None if the signature verification passes.
 * kOTA_Err_SignatureCheckFailed if the signature verification fails.
 * kOTA_Err_BadSignerCert if the if the signature verification certificate cannot be read.
 */
static OTA_Err_t prvPAL_CheckFileSignature( OTA_FileContext_t * const C )
{
    OTA_Err_t   result = kOTA_Err_None;
    uint32_t    ulSignerCertSize;
    void        *pvSigVerifyContext;
    u8          *pucSignerCert = 0;
    uint32_t    addr;
    const struct flash_area *fap;

    if ( (C == NULL) || (C->lFileHandle == 0) || (C != sys_ctx ) )
    {
        configPRINTF( ("%s() Bad Args C:%p\r\n", __func__, C) );
        return kOTA_Err_SignatureCheckFailed;
    }

    fap = (const struct flash_area *)C->lFileHandle ;

    /* Verify an ECDSA-SHA256 signature. */
    if( CRYPTO_SignatureVerificationStart( &pvSigVerifyContext, cryptoASYMMETRIC_ALGORITHM_ECDSA,
                                           cryptoHASH_ALGORITHM_SHA256 ) == pdFALSE )
    {
        configPRINTF( ( "%s() CRYPTO_SignatureVerificationStart() failed\r\n", __func__) );
        return kOTA_Err_SignatureCheckFailed;
    }

    pucSignerCert = prvPAL_ReadAndAssumeCertificate( ( const u8 * const ) C->pucCertFilepath, &ulSignerCertSize );

    if( pucSignerCert == NULL )
    {
        configPRINTF( ( "%s() prvPAL_ReadAndAssumeCertificate() failed\r\n", __func__) );
        return kOTA_Err_BadSignerCert;
    }

    addr = 0 ;
    while (addr < C->ulFileSize)
    {
        uint32_t toread = C->ulFileSize - addr ;
        if (toread > sizeof(buffer))
            toread = sizeof(buffer) ;

        if (flash_area_read(fap, addr, buffer, toread) < 0)
        {
            configPRINTF( ( "%s() flash_area_read() failed\r\n", __func__) );
            return kOTA_Err_SignatureCheckFailed ;
        }

        CRYPTO_SignatureVerificationUpdate( pvSigVerifyContext, buffer, toread);

        addr += toread ;

        /* Yield for a bit */
        vTaskDelay(0);
    }

    if( CRYPTO_SignatureVerificationFinal( pvSigVerifyContext, ( char * ) pucSignerCert, ulSignerCertSize,
                                           C->pxSignature->ucData, C->pxSignature->usSize ) == pdFALSE )
    {
        configPRINTF( ( "%s() CRYPTO_SignatureVerificationFinal() failed\r\n", __func__) );
        result = kOTA_Err_SignatureCheckFailed;
    }

    /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
    if( pucSignerCert != NULL )
    {
        vPortFree( pucSignerCert );
    }

    return result;
}

/**
 * @brief Abort an OTA transfer.
 *
 * Aborts access to an existing open file represented by the OTA file context C. This is only valid
 * for jobs that started successfully.
 *
 * @note The input OTA_FileContext_t C is checked for NULL by the OTA agent before this
 * function is called.
 * This function may be called before the file is opened, so the file pointer C->lFileHandle may be NULL
 * when this function is called.
 *
 * @param[in] C OTA file context information.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 *
 * The file pointer will be set to NULL after this function returns.
 * kOTA_Err_None is returned when aborting access to the open file was successful.
 * kOTA_Err_FileAbort is returned when aborting access to the open file context was unsuccessful.
 */
OTA_Err_t prvPAL_Abort( OTA_FileContext_t * const C )
{
    OTA_Err_t   result = kOTA_Err_None;
    const struct flash_area *fap;

    if ( (C == NULL) || (C != sys_ctx ) )
    {
        configPRINTF( ( "%s() BAD ARGS\r\n", __func__) );
        return kOTA_Err_FileAbort;
    }

    fap = (const struct flash_area *)C->lFileHandle ;
    if (fap != NULL)
    {
        flash_area_close(fap);  /* May have been closed already */
    }

    C->lFileHandle = 0;
    sys_ctx = 0;

    return result;
}

/**
 * @brief Create a new receive file for the data chunks as they come in.
 *
 * @note Opens the file indicated in the OTA file context in the MCU file system.
 *
 * @note The previous image may be present in the designated image download partition or file, so the partition or file
 * must be completely erased or overwritten in this routine.
 *
 * @note The input OTA_FileContext_t C is checked for NULL by the OTA agent before this
 * function is called.
 * The device file path is a required field in the OTA job document, so C->pucFilePath is
 * checked for NULL by the OTA agent before this function is called.
 *
 * @param[in] C OTA file context information.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 *
 * kOTA_Err_None is returned when file creation is successful.
 * kOTA_Err_RxFileTooLarge is returned if the file to be created exceeds the device's non-volatile memory size contraints.
 * kOTA_Err_BootInfoCreateFailed is returned if the bootloader information file creation fails.
 * kOTA_Err_RxFileCreateFailed is returned for other errors creating the file in the device's non-volatile memory.
 */
OTA_Err_t prvPAL_CreateFileForRx( OTA_FileContext_t * const C )
{
    const struct flash_area *fap;

    if (C == NULL)
    {
        configPRINTF( ( "%s() BAD ARGS\r\n", __func__) );
        return kOTA_Err_RxFileCreateFailed;
    }

    /* prepare the slot for writing */
    configPRINTF( ("%s() erase slot two for file pucFilePath:%s\r\n", __func__, C->pucFilePath) );
    configPRINTF( ("           ulFileAttributes: 0x%x\r\n", __func__, C->ulFileAttributes) );
    eraseSlotTwo() ;
    if (flash_area_open(FLASH_AREA_IMAGE_SECONDARY(0), &fap) != 0)
    {
        configPRINTF( ( "%s() flash_area_open() failed\r\n", __func__) );
        return kOTA_Err_RxFileCreateFailed;
    }

    C->lFileHandle = (int32_t)fap;
    sys_ctx = C;

    return kOTA_Err_None;
}

/**
 * @brief Authenticate and close the underlying receive file in the specified OTA context.
 *
 * @note The input OTA_FileContext_t C is checked for NULL by the OTA agent before this
 * function is called. This function is called only at the end of block ingestion.
 * prvPAL_CreateFileForRx() must succeed before this function is reached, so
 * C->lFileHandle(or C->pucFile) is never NULL.
 * The certificate path on the device is a required job document field in the OTA Agent,
 * so C->pucCertFilepath is never NULL.
 * The file signature key is required job document field in the OTA Agent, so C->pxSignature will
 * never be NULL.
 *
 * If the signature verification fails, file close should still be attempted.
 *
 * @param[in] C OTA file context information.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 *
 * kOTA_Err_None is returned on success.
 * kOTA_Err_SignatureCheckFailed is returned when cryptographic signature verification fails.
 * kOTA_Err_BadSignerCert is returned for errors in the certificate itself.
 * kOTA_Err_FileClose is returned when closing the file fails.
 */
OTA_Err_t prvPAL_CloseFile( OTA_FileContext_t * const C )
{
    const struct flash_area *fap ;
    OTA_Err_t               result = kOTA_Err_None;

