aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_064S0S2_4343W/ports/ota/aws_ota_pal.c
    if ( (C == NULL) || (C != sys_ctx ) || (C->lFileHandle == 0))
    {
        configPRINTF( ( "%s() BAD ARGS\r\n", __func__) );
        return kOTA_Err_FileClose;
    }

    configPRINTF( ( "%s()\r\n", __func__) );

    /* we got the data, try to verify it */
    if (C->pxSignature == NULL)
    {
        configPRINTF( ( "%s() No pxSignature from AWS\r\n", __func__) );
        result = kOTA_Err_SignatureCheckFailed ;
    }
    else
    {
        result = prvPAL_CheckFileSignature(C);
        if (result == kOTA_Err_None)
        {
            /* Mark this new OTA image as pending, it will be the permanent
            * bootable image going forward.
            */
            configPRINTF( ("%s() prvPAL_CheckFileSignature() GOOD\r\n", __func__) );
            boot_set_pending(0);
        }
        else
        {
            configPRINTF( ( "%s() prvPAL_CheckFileSignature() failed\r\n", __func__) );
            result = kOTA_Err_SignatureCheckFailed ;
        }
    }

    fap = (const struct flash_area *)C->lFileHandle ;
    flash_area_close(fap);

    return result;
}

/**
 * @brief Write a block of data to the specified file at the given offset.
 *
 * @note The input OTA_FileContext_t C is checked for NULL by the OTA agent before this
 * function is called.
 * The file pointer/handle C->pucFile, is checked for NULL by the OTA agent before this
 * function is called.
 * pcData is checked for NULL by the OTA agent before this function is called.
 * ulBlockSize is validated for range by the OTA agent before this function is called.
 * ulBlockIndex is validated by the OTA agent before this function is called.
 *
 * @param[in] C OTA file context information.
 * @param[in] ulOffset Byte offset to write to from the beginning of the file.
 * @param[in] pcData Pointer to the byte array of data to write.
 * @param[in] ulBlockSize The number of bytes to write.
 *
 * @return The number of bytes written on a success, or a negative error code from the platform abstraction layer.
 */
int16_t prvPAL_WriteBlock( OTA_FileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pcData,
                           uint32_t ulBlockSize )
{
    const struct flash_area *fap ;

    if ( (C == NULL) || (C != sys_ctx ) || (C->lFileHandle == 0))
    {
        configPRINTF( ( "%s() BAD ARGS\r\n", __func__ ) );
        return -1;
    }

    fap = (const struct flash_area *)C->lFileHandle ;
    if (flash_area_write(fap, ulOffset, pcData, ulBlockSize) != 0)
    {
        configPRINTF( ( "%s() flash_area_write() failed\r\n", __func__) );
        return -1;
    }

    return ulBlockSize;
}

/**
 * @brief Activate the newest MCU image received via OTA.
 *
 * This function shall do whatever is necessary to activate the newest MCU
 * firmware received via OTA. It is typically just a reset of the device.
 *
 * @note This function SHOULD not return. If it does, the platform doesn't support
 * an automatic reset or an error occurred.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 */
OTA_Err_t prvPAL_ActivateNewImage( void )
{
    configPRINTF( ("%s() \r\n", __func__) );
    prvPAL_ResetDevice();
    return kOTA_Err_None;
}

/**
 * @brief Reset the device.
 *
 * This function shall reset the MCU and cause a reboot of the system.
 *
 * @note This function SHOULD not return. If it does, the platform doesn't support
 * an automatic reset or an error occurred.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 */
OTA_Err_t prvPAL_ResetDevice( void )
{
    /* we want to wait a bit when in DEBUG builds so the logging mechanism can finish before resetting */
    vTaskDelay(pdMS_TO_TICKS( 1000UL ));
    printf("%s()   RESETTING NOW !!!!\r\n", __func__);
    vTaskDelay(pdMS_TO_TICKS( 100UL ));
    NVIC_SystemReset() ;
    return kOTA_Err_None ;
}

/**
 * @brief Attempt to set the state of the OTA update image.
 *
 * Do whatever is required by the platform to Accept/Reject the OTA update image (or bundle).
 * Refer to the PAL implementation to determine what happens on your platform.
 *
 * @param[in] eState The desired state of the OTA update image.
 *
 * @return The OTA_Err_t error code combined with the MCU specific error code. See aws_ota_agent.h for
 *         OTA major error codes and your specific PAL implementation for the sub error code.
 *
 * Major error codes returned are:
 *
 *   kOTA_Err_None on success.
 *   kOTA_Err_BadImageState: if you specify an invalid OTA_ImageState_t. No sub error code.
 *   kOTA_Err_AbortFailed: failed to roll back the update image as requested by eOTA_ImageState_Aborted.
 *   kOTA_Err_RejectFailed: failed to roll back the update image as requested by eOTA_ImageState_Rejected.
 *   kOTA_Err_CommitFailed: failed to make the update image permanent as requested by eOTA_ImageState_Accepted.
 *
 *
 *   IMPORTANT NOTES:
 *
 *   Our implementation checks the signature on the call to prvPAL_CloseFile().
 *   We assume that if the updated app is running in slot 0 that it is acceptable.
 *
 *   if prvPAL_SetPlatformImageState() is called and the sys_ctx is NULL, we are not in the process of downloading a new image.
 *      if the eState is Rejected or Aborted, it pertains to the in-process download (or invalid job) for Secondary Slot.
 *      We could erase the secondary slot, but we do that each new download start, and will not consider new download OK if not complete.
 *
 */
OTA_Err_t prvPAL_SetPlatformImageState( OTA_ImageState_t eState )
{
    OTA_Err_t   result = kOTA_Err_None;

    PRINT_eSTATE( "-------------------------> prvPAL_SetPlatformImageState() curr eState:", current_OTA_ImageState);
    PRINT_eSTATE( "-------------------------> prvPAL_SetPlatformImageState() new  eSTATE:", eState);
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE(NULL, boot_swap_type());


    if (sys_ctx == NULL)
    {
        /* We are not currently loading an OTA image. This state change pertains to Slot 0 image */
        switch (eState)
        {
        case eOTA_ImageState_Accepted:
            /* Mark Slot 0 image as valid */
            boot_set_confirmed();
//            configPRINTF( ("%s() Accepted <----------------------------------<<\r\n", __func__) );
            break;
        case eOTA_ImageState_Rejected:
        case eOTA_ImageState_Aborted:
            /* We are not actively downloading, this pertains to an invalid download job
             * or an aborted job. We erase secondary slot when we start a new download,
             * and do not consider secondary slot ready unless dowlnoad completes and
             * signature checked. nothing to do here, but set our state to Accepted so
             * we store it for GetImageState().
             */
            eState = eOTA_ImageState_Accepted;
            break;
        case eOTA_ImageState_Testing:
//            configPRINTF( ("%s() OTA Image in TESTING.\r\n", __func__) );
            break;
        default:
            configPRINTF( ("%s() New In-process OTA Unknown state %d.\r\n", __func__, eState) );
            result = kOTA_Err_BadImageState;
            break;
        }
    }
    else
    {
        /* We are in the middle of a new download
         * Abort or Reject refers to the new download, not the primary slot.
         * Not what to do here, if anything...
         */
    }

    /* keep track of the state OTA Agent sent. */
    current_OTA_ImageState = eState;

    PRINT_BOOT_SWAP_TYPE(NULL, boot_type);
    PRINT_eSTATE( "-------------------------> prvPAL_SetPlatformImageState() current  eSTATE:", eState);
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE(NULL, boot_type);

    return result;
}


/**
 * @brief Get the state of the OTA update image.
 *
 * We read this at OTA_Init time and when the latest OTA job reports itself in self
 * test. If the update image is in the "pending commit" state, we start a self test
 * timer to assure that we can successfully connect to the OTA services and accept
 * the OTA update image within a reasonable amount of time (user configurable). If
 * we don't satisfy that requirement, we assume there is something wrong with the
 * firmware and automatically reset the device, causing it to roll back to the
 * previously known working code.
 *
 * If the update image state is not in "pending commit," the self test timer is
 * not started.
 *
 * @return An OTA_PAL_ImageState_t. One of the following:
 *   eOTA_PAL_ImageState_PendingCommit (the new firmware image is in the self test phase)
 *   eOTA_PAL_ImageState_Valid         (the new firmware image is already committed)
 *   eOTA_PAL_ImageState_Invalid       (the new firmware image is invalid or non-existent)
 *
 *   NOTE: eOTA_PAL_ImageState_Unknown should NEVER be returned and indicates an implementation error.
 *
 * We are testing the New application.
 * BOOT_SWAP_TYPE_NONE     1
 * BOOT_SWAP_TYPE_TEST     2    Swap to the secondary slot. Absent a confirm command (STDE - Valid?), revert back on next boot.
 * BOOT_SWAP_TYPE_PERM     3    Swap to the secondary slot, and permanently switch to booting its contents.
 * BOOT_SWAP_TYPE_REVERT   4    Swap back to alternate slot.  A confirm (STDE - Valid?) changes this state to NONE.
 * BOOT_SWAP_TYPE_FAIL     5    Swap failed because image to be run is not valid
 * BOOT_SWAP_TYPE_PANIC    0xff Swapping encountered an unrecoverable error
 */

OTA_PAL_ImageState_t prvPAL_GetPlatformImageState( void )
{
    OTA_PAL_ImageState_t result = eOTA_PAL_ImageState_Unknown;

    PRINT_eSTATE(  "<------------------------- prvPAL_GetPlatformImageState() current  eSTATE:", current_OTA_ImageState);
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE(NULL, boot_swap_type());

    /**
     * After swap/copy of secondary slot to primary slot, boot_swap_type() returns NONE.
     * It does not reflect the fact we may be in self-test mode.
     * Use the saved value from SetImageState() to report our status.
     */
    if( current_OTA_ImageState == eOTA_ImageState_Testing )
    {
        /* in self-test, report Pending. */
        result = eOTA_PAL_ImageState_PendingCommit;
    }
    else
    {
        result = eOTA_PAL_ImageState_Valid;
    }

    PRINT_PAL_STATE( "<------------------------- prvPAL_GetPlatformImageState() DONE: ", result);
    return result ;
}
